<template>
  <span
    class="pop-icon"
    :class="className"
    :style="rootStyle"
  >
    <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" class="pop-icon-svg" fill="currentColor"><path fill-rule="evenodd" d="M11.558 1.394a.75.75 0 0 1 .884 0l2.428 1.772 3.006-.006a.75.75 0 0 1 .715.52l.924 2.86 2.435 1.762a.75.75 0 0 1 .273.841L21.29 12l.934 2.857a.75.75 0 0 1-.273.84l-2.435 1.763-.924 2.86a.75.75 0 0 1-.715.52l-3.006-.006-2.428 1.772a.75.75 0 0 1-.884 0L9.13 20.834l-3.006.006a.75.75 0 0 1-.715-.52l-.923-2.86-2.435-1.762a.75.75 0 0 1-.274-.841L2.711 12l-.935-2.857a.75.75 0 0 1 .274-.84L4.485 6.54l.923-2.86c.1-.31.39-.52.715-.52l3.006.006 2.429-1.772ZM12 2.928 9.815 4.522a.75.75 0 0 1-.443.144l-2.704-.005-.831 2.573a.75.75 0 0 1-.274.377l-2.19 1.586.84 2.57a.75.75 0 0 1 0 .466l-.84 2.57 2.19 1.585a.75.75 0 0 1 .274.378l.83 2.573 2.705-.005c.16 0 .314.05.443.144L12 21.072l2.184-1.594a.75.75 0 0 1 .444-.144l2.704.005.83-2.573a.75.75 0 0 1 .275-.377l2.19-1.586-.84-2.57a.75.75 0 0 1 0-.466l.84-2.57-2.19-1.586a.75.75 0 0 1-.274-.377l-.83-2.573-2.705.005a.75.75 0 0 1-.444-.144L12 2.928Z" clip-rule="evenodd"/><path fill-rule="evenodd" d="M16.53 8.97a.75.75 0 0 1 0 1.06l-5 5a.75.75 0 0 1-1.06 0l-2.5-2.5a.75.75 0 1 1 1.06-1.06L11 13.44l4.47-4.47a.75.75 0 0 1 1.06 0Z" clip-rule="evenodd"/></svg>
  </span>
</template>

<script setup lang="ts">
import { useRunTime } from '../core'
const props = defineProps<{
  /** css尺寸单位字符串 或 以px为单位的数字 */
  size?: string | number
  /** 图标颜色 */
  color?: string
  /** 类名 */
  className?: string
}>()
const { rootStyle } = useRunTime(props)
</script>
